app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "THis that other "], ["created_at", Wed, 14 Nov 2012 01:32:36 UTC +00:00], ["name", "Banner"], ["title", "Whatever"], ["updated_at", Wed, 14 Nov 2012 01:32:36 UTC +00:00]]

  def update
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @post = Post.find(params[:id])
    @post.destroy(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]